export const example1 = `ปัญญาประดิษฐ์ (อังกฤษ: artificial intelligence) หรือ เอไอ (AI) หมายถึงความฉลาดเทียมที่สร้างขึ้นให้กับสิ่งที่ไม่มีชีวิต ปัญญาประดิษฐ์เป็นสาขาหนึ่งในด้านวิทยาการคอมพิวเตอร์ และวิศวกรรมเป็นหลัก แต่ยังรวมถึงศาสตร์ในด้านอื่น ๆ อย่างจิตวิทยา ปรัชญา หรือชีววิทยา ซึ่งสาขาปัญญาประดิษฐ์เป็นการเรียนรู้เกี่ยวกับกระบวนการการคิด การกระทำ การให้เหตุผล การปรับตัว หรือการอนุมาน และการทำงานของสมอง แม้ว่าดังเดิมนั้นเป็นสาขาหลักในวิทยาการคอมพิวเตอร์ แต่แนวคิดหลาย ๆ อย่างในศาสตร์นี้ได้มาจากการปรับปรุงเพิ่มเติมจากศาสตร์อื่น ๆ เช่น การเรียนรู้ของเครื่อง นั้นมีเทคนิคการเรียนรู้ที่เรียกว่า การเรียนรู้ต้นไม้ตัดสินใจ ซึ่งประยุกต์เอาเทคนิคการอุปนัยของจอห์น สจวร์ต มิลล์ นักปรัชญาชื่อดังของอังกฤษ มาใช้เครือข่ายประสาทเทียมก็นำเอาแนวคิดของการทำงานของสมองของมนุษย์ มาใช้ในการแก้ปัญหาการแบ่งประเภทของข้อมูล และแก้ปัญหาอื่น ๆ ทางสถิติ เช่น การวิเคราะห์ความถดถอยหรือ การปรับเส้นโค้ง อย่างไรก็ตาม เนื่องจากปัจจุบันวงการปัญญาประดิษฐ์ มีการพัฒนาส่วนใหญ่โดยนักวิทยาศาสตร์คอมพิวเตอร์ อีกทั้งวิชาปัญญาประดิษฐ์ ก็ต้องเรียนที่ภาควิชาคอมพิวเตอร์ของคณะวิทยาศาสตร์หรือคณะวิศวกรรมศาสตร์ เราจึงถือเอาง่าย ๆ ว่า ศาสตร์นี้เป็นสาขาของวิทยาการคอมพิวเตอร์นั่นเอง
ในช่วงต้นคริสต์ทศวรรษ 1980 งานวิจัยด้านปัญญาประดิษฐ์ประสบความสำเร็จในเชิงพาณิชย์เป็นครั้งแรก ด้วยระบบที่ชื่อว่า ระบบผู้เชี่ยวชาญ อันเป็นระบบคอมพิวเตอร์ที่ช่วยในการหาคำตอบ อธิบายความไม่ชัดเจน ซึ่งปกตินั้นจะใช้ผู้เชี่ยวชาญในแต่ละสาขาตอบคำถามนั้น ในปี ค.ศ. 1985 ตลาดของปัญญาประดิษฐ์ทะยานขึ้นไปแตะระดับ 1 พันล้านดอลลาร์สหรัฐ ในขณะเดียวกัน โครงการคอมพิวเตอร์รุ่นที่ 5 ของญี่ปุ่นก็ได้จุดประกายให้รัฐบาลสหรัฐอเมริกาและสหราชอาณาจักรหันมาให้เงินทุนสนับสนุนงานวิจัยในสาขาปัญญาประดิษฐ์อีกครั้ง
การเรียนรู้ของเครื่อง (machine learning) เป็นการศึกษาอัลกอริทึมคอมพิวเตอร์ที่ขั้นตอนวิธีจะถูกปรับปรุงอย่างอัตโนมัติผ่านการเรียนรู้จากประสบการณ์ เป็นหัวใจหลักของงานวิจัยด้านปัญญาประดิษฐ์นับตั้งแต่มีการก่อตั้งสาขานี้มาการเรียนรู้แบบไม่มีผู้สอน 
(unsupervised learning) เป็นความสามารถในการหาแบบแผนบางอย่างจากข้อมูลที่เข้ามา ส่วนการเรียนรู้แบบมีผู้สอน (supervised learning) นั้นหมายถึงการแบ่งประเภทข้อมูลและการวิเคราะห์การถดถอยเชิงตัวเลข ปัญหาการแบ่งประเภทของข้อมูลนั้นใช้เพื่อกำหนดว่าของชิ้นใหม่ชิ้นหนึ่งจัดอยู่ในกลุ่มประเภทใดหลังจากที่ได้เรียนรู้ตัวอย่างสอนที่ระบุว่าของแต่ละอย่างควรจะอยู่ในประเภทใดมาแล้ว ส่วนการวิเคราะห์การถดถอยนั้นพยายามจะสร้างฟังก์ชันทางคณิตศาสตร์ที่อธิบายความสัมพันธ์ระหว่างข้อมูลขาเข้ากับข้อมูลขาออก และทำนายว่าข้อมูลขาออกควรจะเปลี่ยนไปอย่างไรเมื่อข้อมูลขาเข้าเปลี่ยนแปลง ในการเรียนรู้แบบเสริมกำลัง (reinforcement learning) นั้น เอเยนต์จะได้รับรางวัลหากมีการตอบสนองที่ดีและถูกลงโทษหากมีการตอบสนองที่ไม่ดี เอเยนต์จะเรียนรู้จากรางวัลและการลงโทษนี้ในการสร้างกลยุทธ์เพื่อแก้ไขปัญหาต่าง ๆ การเรียนรู้ทั้งสามแบบนี้สามารถวิเคราะห์ได้ด้วยทฤษฎีการตัดสินใจ (decision theory) โดยใช้แนวคิดของประโยชน์ การวิเคราะห์ทางคณิตศาสตร์ของอัลกอริทึมทางการเรียนรู้ของเครื่องจักรและการวิเคราะห์ประสิทธิภาพของอัลกอริทึมนั้นเป็นอีกหนึ่งสาขาทางด้านวิทยาการคอมพิวเตอร์สายทฤษฎี การเรียนรู้ของเครื่องจักรถือว่าเป็นหัวใจสำคัญของการพัฒนาหุ่นยนต์เช่นกัน ทำให้หุ่นยนต์มีทักษะใหม่ ๆ ได้ ผ่านการสำรวจด้วยตนเอง การติดต่อกับผู้สอนที่เป็นมนุษย์ การเลียนแบบ และอื่น ๆ`

export const example2 = `ขอบเขตและการใช้งานมาตรฐาน
ขอบเขตของมาตรฐานนี้ครอบคลุมการนำเสนอสิ่งเหล่านี้

ISO 8601 คือมาตรฐานสำหรับการนำเสนอตามปฏิทินและเวลา ประกาศโดยองค์การระหว่างประเทศว่าด้วยการมาตรฐาน (ISO) มาตรฐานนี้มีหัวเรื่องว่า "องค์ประกอบข้อมูลและรูปแบบการแลกเปลี่ยน — รูปแบบการแลกเปลี่ยน — การนำเสนอวันที่และเวลา" คุณลักษณะสำคัญของการนำเสนอนี้คือ การจัดอันดับให้ส่วนที่มี ความสำคัญมากกว่าขึ้นก่อน นั่นคือเรียงจากหน่วยใหญ่ที่สุด (ปี) ไปยังหน่วยเล็กที่สุด (วินาที) 
ประวัติ
การประกาศ ISO 8601 ครั้งแรกเกิดขึ้นเมื่อ พ.ศ. 2531 เป็นการรวบรวมและแทนที่มาตรฐาน ISO ของเก่าซึ่งมีสัญกรณ์ที่แตกต่างกันได้แก่ และ [1] แทนที่ด้วยการแก้ไขครั้งที่สองเมื่อ พ.ศ. 2543 และปัจจุบันเป็นการแก้ไขครั้งที่สาม ISO 8601:2004 เผยแพร่เมื่อ 3 ธันวาคม พ.ศ. 2547 มาตรฐานนี้กำกับดูแลโดยคณะกรรมการเทคนิค ISO/TC 154

วันที่ในปฏิทินเกรโกเรียน สามารถนำเสนอได้สามรูปแบบได้แก่
ปี-เดือน-วันที่ของเดือน
ปี-สัปดาห์-วันในสัปดาห์
ปี-วันที่ของปี
เวลาของวัน นำเสนอโดยใช้
การรวมวันที่และเวลาของวัน นำเสนอโดยนำเอาวันที่กับเวลามาต่อกันเป็นค่าเวลาเดียว
ช่วงของเวลา นำเสนอโดยการรวมจุดเริ่มต้น จุดสุดท้าย ระยะเวลา และข้อมูลอื่นที่เป็นบริบท
มาตรฐานนี้กำหนดขึ้นเพื่อตั้งใจให้ใช้งานได้อย่างกว้างขวาง สามารถใช้ได้กับการสื่อสารด้วยวิธีเขียนทั้งหมดที่มีการอ้างอิงถึง วัน เวลา และช่วงเวลา ไม่ว่าสื่อนั้นจะเป็นอะไร (สื่อสิ่งพิมพ์ อิเล็กทรอนิกส์ หรือเขียนด้วยลายมือ) หรือที่อยู่ของผู้ส่งผู้รับอยู่ที่ไหน (ภายในองค์กร ระหว่างองค์กร หรือข้ามประเทศ) การใช้งานมาตรฐานนี้ไม่ได้หมายความว่าจำกัดอยู่เพียงวันเวลาที่ดำเนินการ เก็บบันทึก หรือแสดงผลในคอมพิวเตอร์เท่านั้น แต่ยังใช้ได้กับอุตสาหกรรมทุกประเภทและกิจกรรมของมนุษย์ทุกรูปแบบ ที่ซึ่งการนำเสนอวันเวลาอย่างแม่นยำและไร้ความกำกวมเป็นสิ่งที่จำเป็น เพื่อใช้สื่อสารกันระหว่างประเทศ ระดับชาติ ระดับท้องถิ่น ระดับภายใน หรือแม้แต่ระดับส่วนตัว

มาตรฐานนี้ไม่ได้บังคับหรือห้ามใช้คำแทนสำหรับวันที่ วันที่ในลักษณะคำบรรยายถูกละเว้นเอาไว้จากมาตรฐาน เพราะว่าการใช้งานเฉพาะภาษาส่วนใหญ่อาจทำให้เกิดความติดขัดในการสื่อสารระหว่างประเทศ

หลักการทั่วไป
ค่าของวันที่และเวลาจะถูกจัดอันดับ จากมากที่สุดไปยังน้อยที่สุด นั่นคือ ปี เดือน วันที่ของเดือน ชั่วโมง นาที วินาที และเศษของวินาที การจัดอันดับการนำเสนอเช่นนี้สอดคล้องกับการจัดอันดับตามเวลา เว้นแต่ว่าการนำเสนอนั้นเกี่ยวข้องกับจำนวนปีที่ติดลบ
ค่าของวันที่และเวลาแต่ละตัว มีจำนวนหลักของเลขโดดที่แน่นอน หากจำนวนหลักไม่ครบให้เติม 0 ข้างหน้าจนครบ
การนำเสนอสามารถกระทำได้สองรูปแบบ หนึ่งคือ รูปแบบพื้นฐาน โดยใช้เครื่องหมายคั่นน้อยหรือไม่ใช้เลย สองคือ รูปแบบขยาย โดยจะมีเครื่องหมายเพิ่มเติมเข้ามาเพื่อเพิ่มความสามารถในการอ่านโดยมนุษย์ [2] เครื่องหมายคั่นที่ใช้ระหว่างค่าวันที่คือยัติภังค์ (-) และทวิภาค (:) สำหรับค่าเวลา ตัวอย่างเช่น วันที่ 6 มกราคม ค.ศ. 2009 จะเขียนเป็น "20090106" ในรูปแบบพื้นฐานและ "2009-01-06" ในรูปแบบขยาย รูปแบบขยายมักจะเป็นที่นิยมมากกว่ารูปแบบพื้นฐาน ด้วยเหตุผลที่นอกเหนือจากความสามารถในการอ่านแล้ว แต่ยังเป็นเพราะการปรากฏของรูปแบบพื้นฐานบางค่าอาจทำให้เกิดความกำกวม หรือถูกมองว่าไม่เป็นมาตรฐาน
การลดความเจาะจงของวันเวลา ค่าของตัวเลขสามารถตัดออกจากการนำเสนอวันที่ในรูปแบบใดก็ได้ แต่จะต้องตัดออก จากนัยสำคัญน้อยที่สุดไปมากที่สุด ตัวอย่างเช่น "2004-05" คือวันที่มาตรฐานตาม ISO 8601 หมายถึงเดือนพฤษภาคม ค.ศ. 2004 ไม่ได้หมายถึงวันที่ 5 ของเดือนที่ไม่ทราบใน ค.ศ. 2004
เมื่อวันเวลาต้องการความแม่นยำมากขึ้น มาตรฐานนี้รองรับการเพิ่ม เศษทศนิยม ไปยังค่าเวลาที่เล็กที่สุดในการนำเสนอนั้น
วันที่
มาตรฐานนี้ใช้ปฏิทินเกรโกเรียน ซึ่งเป็นปฏิทินที่ใช้อย่างแพร่หลายมากที่สุดในโลก และเป็นมาตรฐานโดยพฤตินัยสำหรับการค้าระหว่างประเทศ

สัญกรณ์ที่ใช้กับปีก่อนคริสตกาล (BC) จะไม่ถูกนำมาใช้ แต่จะใช้เป็นปีติดลบแทน ตัวอย่างเช่น 3 ปีก่อนคริสตกาล เขียนแทนได้ด้วย −0002 ตัวเลขต่างกันอยู่ 1 เนื่องจากระบบปีก่อนคริสตกาลไม่มีปีที่ศูนย์ ดังนั้นปี 0000 ของ ISO จะหมายถึง 1 ปีก่อนคริสตกาล
วันที่ตามปฏิทิน
การนำเสนอวันที่ตามปฏิทินมีสองรูปแบบคือรูปแบบขยายกับรูปแบบพื้นฐานดังที่ได้กล่าวไว้แล้ว [YYYY] คือปีคริสต์ศักราชสี่หลัก 0000 ถึง 9999 [MM] คือเลขเดือนสองหลัก 01 ถึง 12 และ [DD] คือวันที่ของเดือนสองหลัก 01 ถึง 31 ตัวอย่างเช่น วันที่ 5 เมษายน ค.ศ. 1981 เขียนแทนได้เป็น "1981-04-05" หรือ "19810405"

มาตรฐานนี้อนุญาตให้วันที่ตามปฏิทินสามารถลดความเจาะจงได้ เช่น "1984-04" หมายถึง เดือนเมษายน ค.ศ. 1984, "1984" หมายถึงปี ค.ศ. 1984, "19" หมายถึงคริสต์ศตวรรษที่ 19




ต่อไปนี้เป็นการอธิบายที่เทียบเท่าร่วมกันของสัปดาห์ที่ 01 ว่าอยู่ที่ใด

สัปดาห์ที่มีวันพฤหัสบดีแรกของปี (กำหนดโดย ISO) เลขสัปดาห์จึงอาจอธิบายได้ว่าเป็นการนับจำนวนครั้งของวันพฤหัสบดี เช่นสัปดาห์ 12 จะมีวันพฤหัสบดีครั้งที่ 12 ของปีในสัปดาห์นั้น
สัปดาห์ที่มีวันที่ 4 มกราคม อยู่ในสัปดาห์นั้น
สัปดาห์ที่มีวันส่วนใหญ่ (ตั้งแต่ 4 วันขึ้นไป) อยู่ในสัปดาห์นั้น
สัปดาห์ที่เริ่มด้วยวันจันทร์ในช่วงวันที่ 29 ธันวาคม ถึง 4 มกราคม
ดังนั้นหากวันที่ 1 มกราคม ตรงกับวันจันทร์ วันอังคาร วันพุธ หรือวันพฤหัสบดี สัปดาห์จะนั้นเป็นสัปดาห์ที่ 01 ถ้าวันที่ 1 มกราคม ตรงกับวันศุกร์ วันเสาร์ หรือวันอาทิตย์ สัปดาห์นั้นจะยังคงอยู่ในสัปดาห์ที่ 52 หรือ 53 ของปีก่อนหน้า และวันที่ 28 ธันวาคม จะอยู่ในปีก่อนหน้าเสมอ

ปีที่นับตามสัปดาห์ของ ISO จะเริ่มจากวันแรก (วันจันทร์) ของสัปดาห์ที่ 01 ไปจนสิ้นสุดวันอาทิตย์ที่อยู่ก่อนวันแรกของปีถัดไป ทำให้มีสัปดาห์เต็ม 7 วันเป็นจำนวน 52 หรือ 53 สัปดาห์ โดยไม่มีช่วงทับซ้อนหรือเว้นว่าง การนับปีตามสัปดาห์ของ ISO จะเบี่ยงเบนไปจากปีตามปฏิทินเกรโกเรียนโดยปกติ ในวันศุกร์-เสาร์-อาทิตย์, หรือวันเสาร์-อาทิตย์, หรือเฉพาะวันอาทิตย์ ของจุดเริ่มต้นของปีปฏิทิน (ซึ่ง ISO จะถือว่าอยู่ในปีก่อนหน้า) และในวันจันทร์-อังคาร-พุธ, หรือวันจันทร์-อังคาร, หรือเฉพาะวันจันทร์ ของจุดสิ้นสุดของปีปฏิทิน (ซึ่ง ISO จะถือว่าอยู่ในสัปดาห์ที่ 01 ของปีใหม่) สำหรับวันพฤหัสบดี ปีปฏิทินและปีตาม ISO จะตรงกันเสมอ ตัวอย่างเช่น
`

export const example3 = ``